Catalogs/ЭлектронныеКурсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ЭлектронныеКурсы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерРедакции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоставщикиЭлектронныхКурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтартоваяСтраница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УдалитьТекстыЭлектронныхКурсов</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныеРесурсы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФинальнаяСтраница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УдалитьТекстыЭлектронныхКурсов</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныеРесурсы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЭлектронныхКурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СправочнаяИнформация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УдалитьТекстыЭлектронныхКурсов</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныеРесурсы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Глоссарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныеГлоссарии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Презентация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныеРесурсы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецЭлектронногоКурса</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВладелецЭлектронногоКурса</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/НастройкиЭлектронныхКурсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НастройкиЭлектронныхКурсов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РазработчикКурсов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоставщикиЭлектронныхКурсов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИзменятьТолькоСвоиКурсы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШиринаВидеоПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЯзыкИнтерфейса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЯзыкиИнтерфейсаЭлектронныхКурсов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТемаОформления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТемыОформленияЭлектронныхКурсов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоказыватьСлужебныеЭлектронныеКурсы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИзмененныеЭлектронныеКурсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИзмененныеЭлектронныеКурсы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ГотовКПубликации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЭлектронныйКурс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныеКурсы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыЭлектронныхКурсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыЭлектронныхКурсов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Тест</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Учебник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Слайдовый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SCORM</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ЭлектронныеКурсы/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ОписаниеДопустимыхТиповПеретаскивания; // Типы, которые можно перетаскивать в курс

#КонецОбласти


#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Получаем переменные
	
	ЕстьПравоИзменения = ПравоДоступа("Изменение", Метаданные.Справочники.ЭлектронныеКурсы);	
	
	// Прячем все команды Создать
	
	ВсеТипыКурсов = Новый Массив;;
	
	Для каждого ТипКурса Из Перечисления.ТипыЭлектронныхКурсов Цикл	
		ВсеТипыКурсов.Добавить(ТипКурса);	
	КонецЦикла;	
	
	ВсегоТиповКурсов = ВсеТипыКурсов.Количество();
	
	Для каждого ТипКурса Из ВсеТипыКурсов Цикл	
		ИмяТипа = ЭлектронноеОбучениеСлужебный.ИмяЗначенияПеречисления(ТипКурса);		
		ЭлектронноеОбучениеСлужебныйКлиентСервер.УстановитьВидимостьЭлементаФормыБезопасно(ЭтотОбъект, "КомандаСоздать" + ИмяТипа, Ложь);
		ЭлектронноеОбучениеСлужебныйКлиентСервер.УстановитьВидимостьЭлементаФормыБезопасно(ЭтотОбъект, "КомандаПодменюСоздать" + ИмяТипа, Ложь);
	КонецЦикла;	
	
	// Показываем нужные команды Создать
	
	ТипыКурсов = РазработкаЭлектронныхКурсовСлужебный.ТипыЭлектронныхКурсов();
	
	Если ЕстьПравоИзменения Тогда
	
		Если ТипыКурсов.Количество() > 1 Тогда			
			ЭлектронноеОбучениеСлужебныйКлиентСервер.УстановитьВидимостьЭлементаФормыБезопасно(ЭтотОбъект, "ПодменюСоздать", Истина);
			Для каждого ТипКурса Из ТипыКурсов Цикл
				ИмяТипа = ЭлектронноеОбучениеСлужебный.ИмяЗначенияПеречисления(ТипКурса);
				ЭлектронноеОбучениеСлужебныйКлиентСервер.УстановитьВидимостьЭлементаФормыБезопасно(ЭтотОбъект, "КомандаПодменюСоздать" + ИмяТипа, Истина);
			КонецЦикла;
		Иначе			
			ЭлектронноеОбучениеСлужебныйКлиентСервер.УстановитьВидимостьЭлементаФормыБезопасно(ЭтотОбъект, "ПодменюСоздать", Ложь);
			ИмяТипа = ЭлектронноеОбучениеСлужебный.ИмяЗначенияПеречисления(ТипыКурсов[0]);
			ЭлектронноеОбучениеСлужебныйКлиентСервер.УстановитьВидимостьЭлементаФормыБезопасно(ЭтотОбъект, "КомандаСоздать" + ИмяТипа, Истина);					
		КонецЕсли;
		
	КонецЕсли;
	
	// Устанавливаем параметры списков
	
	УстановитьПараметрыСпискаЭлектронныхКурсов();
		
	// Устанавливаем видимость элементов курса	
	
	Если Параметры.Свойство("РежимВыбора")
		И Параметры.РежимВыбора Тогда
		
		Элементы.Список.РежимВыбора = Истина;
		
	КонецЕсли;
	
	УстановитьВидимостьПредупрежденияОбИзмененныхКурсах();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЭлектронныйКурсЗаписан" Тогда
		Элементы.Список.Обновить();
		ПодключитьОбработчикОжидания("Подключаемый_ОбновитьПредупреждениеОбИзмененныхКурсах", 2, Истина);
	КонецЕсли;

	Если ИмяСобытия = "ВыполняетсяПубликацияЭлектронногоКурса" Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ОбновитьПредупреждениеОбИзмененныхКурсах", 2, Истина);
	КонецЕсли;
	
	Если ИмяСобытия = "ОбновленыНастройкиЭлектронныхКурсов" Тогда
		ОбновитьСписокЭлектронныхКурсов();
	КонецЕсли;

	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Список


&НаКлиенте
Процедура СписокПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	#Если НЕ ВебКлиент И НЕ МобильныйКлиент Тогда
		
	ТипЗначения = ТипЗнч(ПараметрыПеретаскивания.Значение);
	
	// 1. Проверяем возможность перетаскивания, когда нет описания типов.
	
	Если ОписаниеДопустимыхТиповПеретаскивания = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// 2. Проверяем возможность перетаскивания с описанием допустимых типов.
	
	Если ТипЗначения = Тип("Массив") Тогда
		ТипЗначения = ТипЗнч(ПараметрыПеретаскивания.Значение[0]);
	КонецЕсли;
	
	Если ОписаниеДопустимыхТиповПеретаскивания.СодержитТип(ТипЗначения) Тогда		
		СтандартнаяОбработка = Ложь;
		ПараметрыПеретаскивания.ДопустимыеДействия = ДопустимыеДействияПеретаскивания.Копирование;		
	КонецЕсли;		
	
	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура СписокПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	#Если НЕ ВебКлиент И НЕ МобильныйКлиент Тогда

	Если (ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Массив")
		И ПараметрыПеретаскивания.Значение.Количество() > 0
		И ТипЗнч(ПараметрыПеретаскивания.Значение[0]) = Тип("Файл"))
		ИЛИ ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Файл") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Массив") Тогда		
			МассивФайлов = ПараметрыПеретаскивания.Значение;
		Иначе
			МассивФайлов = Новый Массив;
			МассивФайлов.Добавить(ПараметрыПеретаскивания.Значение);
		КонецЕсли;
		
		КаталогДляЗагрузкиВКурс = Неопределено;
		
		Для каждого ФайлДляЗагрузки Из МассивФайлов Цикл
		
			Если ФайлДляЗагрузки.ЭтоКаталог() Тогда
				КаталогДляЗагрузкиВКурс = ФайлДляЗагрузки;
				Прервать;
			КонецЕсли;
		
		КонецЦикла;
		
		Если КаталогДляЗагрузкиВКурс <> Неопределено Тогда
			
			ТипыКурсов = РазработкаЭлектронныхКурсовСлужебныйВызовСервера.ТипыЭлектронныхКурсов();
			
			ТипКурса = Неопределено;
			
			Если ТипыКурсов.Количество() = 1 Тогда
				
				ТипКурса = ТипыКурсов[0];
				
			Иначе
				
				ЭтоФайлыДляСлайдовогоКурса = РазработкаЭлектронныхКурсовСлужебныйКлиентСервер.ЭтоФайлыДляСлайдовогоКурса(КаталогДляЗагрузкиВКурс.ПолноеИмя);
				
				Если ЭтоФайлыДляСлайдовогоКурса Тогда
					ТипКурса = ПредопределенноеЗначение("Перечисление.ТипыЭлектронныхКурсов.Слайдовый");
				Иначе
					ТипКурса = ПредопределенноеЗначение("Перечисление.ТипыЭлектронныхКурсов.Учебник");
				КонецЕсли;
				
			КонецЕсли;
			
			Если ТипКурса = ПредопределенноеЗначение("Перечисление.ТипыЭлектронныхКурсов.Слайдовый") Тогда
				ТекстПредупреждения = НСтр("ru = 'Будет создан слайдовый курс из файлов каталога ""%1"". Продолжить?'");
			ИначеЕсли ТипКурса = ПредопределенноеЗначение("Перечисление.ТипыЭлектронныхКурсов.Учебник") Тогда
				ТекстПредупреждения = НСтр("ru = 'Будет создан электронный учебник из файлов каталога ""%1"". Продолжить?'");
			Иначе
				ВызватьИсключение НСтр("ru = 'Тип курса не определен'");				
			КонецЕсли;
			
			ПараметрыПродолжения = Новый Структура("ПутьККаталогуДляЗагрузкиВКурс, ТипКурса", КаталогДляЗагрузкиВКурс.ПолноеИмя, ТипКурса);			
			ТекстПредупреждения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстПредупреждения, КаталогДляЗагрузкиВКурс.Имя);					
			Оповещение = Новый ОписаниеОповещения("Подключаемый_ЗагрузитьФайлыСДискаВБазу", ЭтотОбъект, ПараметрыПродолжения);		
			ПоказатьВопрос(Оповещение, ТекстПредупреждения, РежимДиалогаВопрос.ДаНет);
			
		КонецЕсли;
			
	КонецЕсли;

	#КонецЕсли	
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗагрузитьФайлыСДискаВБазу(Результат, ДополнительныеПараметры) Экспорт
	
	#Если НЕ ВебКлиент И НЕ МобильныйКлиент Тогда
		
	Если НЕ ЗначениеЗаполнено(ДополнительныеПараметры.ПутьККаталогуДляЗагрузкиВКурс) Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;	
		
	ПараметрыФормыКурса = Новый Структура;
	ПараметрыФормыКурса.Вставить("ПутьККаталогуСФайламиКурса", ДополнительныеПараметры.ПутьККаталогуДляЗагрузкиВКурс);
	ПараметрыФормыКурса.Вставить("РежимРедактирования", Истина);
	ПараметрыФормыКурса.Вставить("ТипЭлектронногоКурса", ДополнительныеПараметры.ТипКурса);
	
	Состояние(НСтр("ru = 'Загружается каталог...'"),,ДополнительныеПараметры.ПутьККаталогуДляЗагрузкиВКурс);
	
	ОткрытьФорму("ОбщаяФорма.ЭлектронныйКурс", ПараметрыФормыКурса, ЭтотОбъект);		
		
	#КонецЕсли

КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура Настройки(Команда)
	ОткрытьФорму("РегистрСведений.НастройкиЭлектронныхКурсов.Форма.РедактированиеНастроек");
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияИзмененныеКурсыНажатие(Элемент)
	ОткрытьФорму("РегистрСведений.ИзмененныеЭлектронныеКурсы.ФормаСписка");
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура Подключаемый_ОбновитьПредупреждениеОбИзмененныхКурсах()	
	ОбновитьПредупреждениеОбИзмененныхКурсах();	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПредупреждениеОбИзмененныхКурсах()	
	
	Если НЕ ЕстьПравоИзменения Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьВидимостьПредупрежденияОбИзмененныхКурсах();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПредупрежденияОбИзмененныхКурсах()
	
	Если НЕ ЕстьПравоИзменения Тогда
		Элементы.ГруппаИзмененные.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	КоличествоИзмененных = РегистрыСведений.ИзмененныеЭлектронныеКурсы.КоличествоИзмененныхКурсов();
	
	Если КоличествоИзмененных > 0 Тогда		
		Элементы.ГруппаИзмененные.Видимость = Истина;
		КоличествоИзмененныхСтрокой = НСтр("ru = ';%1 курс отредактирован;;%1 курса отредактировано;%1 курсов отредактировано;%1 курса отредактировано'");
		КоличествоИзмененныхСтрокой = СтрокаСЧислом(КоличествоИзмененныхСтрокой, КоличествоИзмененных, ВидЧисловогоЗначения.Количественное);
		Элементы.ДекорацияИзмененныеКурсы.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1, но изменения еще не опубликованы и не будут доступны при изучении курса'"), КоличествоИзмененныхСтрокой);
	Иначе
		Элементы.ГруппаИзмененные.Видимость = Ложь;
		Возврат;		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыСпискаЭлектронныхКурсов()
	
	Список.Параметры.УстановитьЗначениеПараметра("ПоказыватьСлужебныеЭлектронныеКурсы",
		РегистрыСведений.НастройкиЭлектронныхКурсов.Значение("ПоказыватьСлужебныеЭлектронныеКурсы"));
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокЭлектронныхКурсов()
	
	УстановитьПараметрыСпискаЭлектронныхКурсов();
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти

#Область Инициализация

МассивТипов = Новый Массив;
#Если НЕ ВебКлиент И НЕ МобильныйКлиент Тогда
МассивТипов.Добавить(Тип("Файл"));
#КонецЕсли
ОписаниеДопустимыхТиповПеретаскивания = Новый ОписаниеТипов(МассивТипов);

#КонецОбласти
